#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
//移位操作符
//int main()
//{
//	int a = -6;
//	int b = (a >> 1);
//	//10000000000000000000000000000110 原码
//	//11111111111111111111111111111001
//	//11111111111111111111111111111010
//	//11111111111111111111111111111101  原码
//	//10000000000000000000000000000011
//	printf("%d", b);
//
//	return 0;
//}

//位操作符： & （按位与） | （按位或） ^(按位异或） ~（按位取反）
//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a & b;
//	int d = a | b;
//	//00000000000000000000000000000011  a的补码
//	//10000000000000000000000000000101  b的原码
//	//11111111111111111111111111111010
//	//11111111111111111111111111111011  b的补码
//	//00000000000000000000000000000011
//   //&11111111111111111111111111111011
//	//00000000000000000000000000000011 //正数的原码也是补码
//	printf("%d\n", c);//3
//	printf("%d\n", d);//-5
//	//00000000000000000000000000000011
//   //|11111111111111111111111111111011
//	//11111111111111111111111111111011 补码
//	//10000000000000000000000000000101 原码
//	return 0;
//}
//int main()
//{
//	int a = 6;
//	int b = -5;
//	int c = a ^ b;
//
//	//00000000000000000000000000000110  a的补码
//   //^11111111111111111111111111111011  b的补码
//	//11111111111111111111111111111101 相同为0，相反为1
//	//10000000000000000000000000000011 
//
//	printf("%d\n", c);//-3
//	return 0;
//}
//创建第三个变量，实现两个整数的交换
//int main()
//{
//	int a = 0;
//	int b = 0;
//	scanf("%d %d", &a, &b);
//	printf("交换前 a=%d b=%d\n", a, b);
//	int c = 0;
//	c = a;
//	a = b;
//	b = c;
//	printf("交换后 a=%d b=%d\n", a, b);
//	return 0;
//}
//不创建第三个变量，实现两个整数的交换
//1.
//int main()
//{
//	int a = 0;
//	int b = 0;
//	scanf("%d %d", &a, &b);
//	printf("交换前 a=%d b=%d\n", a, b);
//	a = a + b;
//	b = a - b;//此时b=a
//	a = a - b;
//	printf("交换后 a=%d b=%d\n", a, b);
//	return 0;
//}
//2.
//int main()
//{
//	int a = 0;
//	int b = 0;
//	scanf("%d %d", &a, &b);
//	printf("交换前 a=%d b=%d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;//此时b=a
//	a = a ^ b;//此时a=a^b,b=a 则a = a ^ b = a ^ b ^a = b
//	
//	printf("交换后 a=%d b=%d\n", a, b);
//	return 0;
//}

//求一个整数对应的二进制数中1的个数
//int count_bit1_of_n(int n)
//{
//	int count = 0;
//	while (n)
//	{
//		if (n % 2 == 1)
//			count++;
//		n /= 2;
//	}
//	return count;
//}
//int main()
//{
//	int n;
//	scanf("%d", &n);
//	int i = count_bit1_of_n(n);
//	printf("%d",i);
//	return 0;
//}
//求一个整数对应的二进制数中1的个数
//int count_bit1_of_n(int n)
//{
//	int count = 0;
//	int i = 0;
//
//	for (i = 0; i < 32; i++)
//	{
//		if (((n >> i) & 1) == 1)
//			count++;
//	}
//	return count;
//}
//int main()
//{
//	int n;
//	scanf("%d", &n);
//	int r = count_bit1_of_n(n);
//	printf("%d",r);
//	return 0;
//}
//求一个整数对应的二进制数中1的个数
int count_bit1_of_n(int n)
{
	int count = 0;
	int i = 0;
	while (n)
	{
		n = n & (n - 1);//循环一次便去掉一位1
		count++;
	}
	return count;
}
int main()
{
	int n;
	scanf("%d", &n);
	int r = count_bit1_of_n(n);
	printf("%d", r);
	return 0;
}