#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//int main()
//{
//	int a[5] = { 1, 2, 3, 4, 5 };
//	int* ptr = (int*)(&a + 1);
//	printf("%d,%d", *(a + 1), *(ptr - 1));
//	return 0;
//}
//&a表示将整个数组的地址取出；+1后跳过整个数组
//指针变量ptr中存放的是被强转为int*类型的跳过整个数组的地址
//*(a+1)：a表示数组首元素地址，+1后第第二个元素2的地址，解引用后得到第二个元素，即2
//*(ptr-1)：ptr-1即a中最后一个元素5的地址，解引用后得到5，即5

//#include <stdio.h>
//在x86环境下
//假设结构体的⼤⼩是20个字节
//程序输出的结果是啥？
//struct Test
//{
//	int Num;
//	char* pcName;
//	short sDate;
//	char cha[2];
//	short sBa[4];
//}*p = (struct Test*)0x100000;
//int main()
//{
//	指针+-取决于指针的类型
//	printf("%p\n", p + 0x1);
//	p是结构体指针变量，类型是结构体类型，p+1就是跳过一个结构体变量的大小即20字节
//	即0x100014(十六进制）
//	以%p的形式打印，x86环境即32位环境（4个字节），一个字节=两个十六进制位，共打印8位，即00100014
//	printf("%p\n", (unsigned long)p + 0x1);
//	首先p被强转为无符号整型类型，接着+1，那就是直接+1即可（整形），即0x100001
//	x86环境下即00100001
//	printf("%p\n", (unsigned int*)p + 0x1);
//	首先p被强转为无符号整形指针，+1跳过一个整形变量大小，即0x100004
//	x86环境下即00100004
//	return 0;
//
//}

//#include <stdio.h>
//int main()
//{
//	int a[3][2] = { (0, 1), (2, 3), (4, 5) };
//	//此处并非完全初始化，而是由逗号表达式得到结果后再进行初始化，即{1,3,5}
//	int* p;
//	p = a[0];//a[0] = {1,3}
//	printf("%d", p[0]);
//	//显然p[0]是1
//	return 0;
//}

////假设环境是x86环境，程序输出的结果是啥？
//#include <stdio.h>
//int main()
//{
//	int a[5][5];
//	int(*p)[4];
//	p = a;
//	//此处a是二维数组的首元素地址，即a[0],类型为int(*)[5]
//	//而p的类型是int(*)[4],因此，将a的地址赋给p后，p+1会跳过4个整形
//	printf("%p,%d\n", &p[4][2] - &a[4][2], &p[4][2] - &a[4][2]);
//	//随着数组下标的增长，地址也会逐渐增加，因此原式为小地址 - 大地址 = 负数
//	//根据图中信息可知，&p[4][2] - &a[4][2] = -4
//	//%p认为内存中存放的是补码就是地址，因此会将-4的补码打印出来
//	// -4
//	// 100000000 00000000 00000000 00000100
//	// 111111111 11111111 11111111 11111011
//	// 111111111 11111111 11111111 11111100
//	// FF        FF       FF       FC
//	//%d认为内存中存放的是有符号整数的补码，会打印有符号整数，即-4
//	return 0;
//}










//#include <stdio.h>
//int main()
//{
//	int aa[2][5] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
//	int* ptr1 = (int*)(&aa + 1);
//	//&aa表示将整个数组地址取出，+1后跳过整个数组，然后被强转为整形类型指针，此时指向元素10后面的元素
//	int* ptr2 = (int*)(*(aa + 1));
//	//aa表示数组首元素aa[0]的地址，+1后指向a[1]，解引用后得到一维数组a[1]本身，退化为一个int*类型的指针，指向元素6
//	//或者直接将*(aa + 1)等价于aa[1]处理，此时指向元素6
//	printf("%d,%d", *(ptr1 - 1), *(ptr2 - 1));
//	//*(ptr1 - 1)即10
//	//*(ptr2 - 1)即5
//	return 0;
//}












//#include <stdio.h>
//int main()
//{
//	char* a[] = { "work","at","alibaba" };
//	//a是一个指针数组名，里面存放三个字符串首字符的地址
//	//a[0]即work\0
//	//a[1]即at\0
//	//a[2]即alibaba\0
//	char** pa = a;
//	//此处a为数组首元素地址,也就是将a[0]的地址赋给二级指针变量pa,pa指向的是a[0]
//	pa++;
//	//pa++即a[1]的地址
//	printf("%s\n", *pa);
//	//*pa就是a[1]中的元素，即at
//	return 0;
//}

















#include <stdio.h>
int main()
{
	char* c[] = { "ENTER","NEW","POINT","FIRST" };
	char** cp[] = { c + 3,c + 2,c + 1,c };
	char*** cpp = cp;
	printf("%s\n", **++cpp);
	//++cpp后指向cp[1]，经两次解引用后得到POINT
	printf("%s\n", *--*++cpp + 3);
	//此时cpp指向的是cp[1],接着*++cpp即cp[2],接着*--后得到C[0],+3跳过3个字符，即ER
	printf("%s\n", *cpp[-2] + 3);
	//*cpp[-2]等价于**(cpp-2),cpp此时指向的是cp[2],**(cpp-2)后即C[3],+3跳过三个字符即ST 
	printf("%s\n", cpp[-1][-1] + 1);
	//cpp[-1][-1]等价于*(*(cpp-1)-1),即C[1]，即EW
	return 0;
}